kAMDSuccess = "Сталася помилка.";
kAMDUndefinedError = "Сталася невідома помилка.";
kAMDBadHeaderError = "Не вдалося передати файл.";
kAMDNoResourcesError = "Не вдалося виділити ресурс.";
kAMDReadError = "Не вдалося зчитати з пристрою.";
kAMDWriteError = "Не вдалося записати на пристрій.";
kAMDUnknownPacketError = "Невідомий пакет.";
kAMDInvalidArgumentError = "Неправильний аргумент.";
kAMDNotFoundError = "Не вдалося знайти файл.";
kAMDIsDirectoryError = "Шлях — це каталог.";
kAMDPermissionError = "Ви не маєте дозволу.";
kAMDNotConnectedError = "Не підключено до пристрою.";
kAMDTimeOutError = "Вичерпано час очікування операції.";
kAMDOverrunError = "Відбулося перевищення буфера.";
kAMDEOFError = "Кінець файлу.";
kAMDUnsupportedError = "Ця операція не підтримується";
kAMDFileExistsError = "Файл уже існує.";
kAMDBusyError = "Пристрій зайнятий.";
kAMDCryptoError = "Не вдалося встановити безпечне підключення до пристрою.";
kAMDTooBigError = "Завелике повідомлення.";
kAMDInvalidResponseError = "Одержано непередбачувану відповідь від пристрою.";
kAMDMissingKeyError = "Відсутній ключ.";
kAMDMissingValueError = "Відсутнє значення.";
kAMDGetProhibitedError = "Не вдається отримати значення з пристрою, захищеного кодом допуску.";
kAMDSetProhibitedError = "Не вдається встановити значення на пристрої.";
kAMDRemoveProhibitedError = "Не вдається видалити значення на пристрої.";
kAMDImmutableValueError = "Це значення не можна змінити.";
kAMDPasswordProtectedError = "Пристрій захищено паролем.";
kAMDMissingHostIDError = "Пристрій не розпізнає цей хост.";
kAMDInvalidHostIDError = "Пристрій не розпізнає цей хост.";
kAMDSessionActiveError = "Активна сесія.";
kAMDSessionInactiveError = "Неактивна сесія.";
kAMDMissingSessionIDError = "Відсутній ідентифікатор сесії.";
kAMDInvalidSessionIDError = "Неприпустимий ідентифікатор сесії.";
kAMDMissingServiceError = "Відсутня служба.";
kAMDInvalidServiceError = "Неправильна служба.";
kAMDServiceLimitError = "Уже запущено забагато екземплярів цієї служби.";
kAMDCheckinSetupFailedError = "Не вдалося запустити службу на пристрої.";
kAMDInvalidCheckinError = "Не вдалося запустити службу на пристрої.";
kAMDCheckinTimeoutError = "Служба запущена неправильно на пристрої.";
kAMDCheckinConnectionFailedError = "Служба запущена неправильно на пристрої.";
kAMDCheckinReceiveFailedError = "Служба запущена неправильно на пристрої.";
kAMDCheckinResponseFailedError = "Служба запущена неправильно на пристрої.";
kAMDCheckinOutOfMemoryError = "Служба запущена неправильно на пристрої.";
kAMDCheckinSendFailedError = "Служба запущена неправильно на пристрої.";
kAMDMissingPairRecordError = "Хост не спарено з пристроєм.";
kAMDInvalidPairRecordError = "Хост більше не спарений із пристроєм.";
kAMDSavePairRecordFailedError = "Не вдалося зберегти запис парування.";
kAMDInvalidActivationRecordError = "Недійсний запис активації.";
kAMDMissingActivationRecordError = "Не вдається знайти запис активації.";
kAMDServiceProhibitedError = "Не вдалося запустити службу на пристрої.";
kAMDEscrowLockedError = "Пристрій недоступний до першого відімкнення після перезавантаження.";
kAMDProhibitedBySupervision = "Операцію заборонено на пристроях під наглядом.";
kAMDPairingProhibitedError = "Парування можливе лише через USB-кабель.";
kAMDWrongDroidError = "Пристрій перебуває в режимі лагодження.";
kAMDSUVerificationError = "Не вдалося перевірити пакет оновлення програмного забезпечення.";
kAMDSUPatchError = "Не вдалося виправити файл.";
kAMDSUFirmwareError = "Не вдалося перепрограмувати прошивку.";
kAMDProvisioningProfileNotValid = "Недійсний профіль ініціалізації.";
kAMDSendMessageError = "Не вдалося надіслати повідомлення на пристрій.";
kAMDReceiveMessageError = "Не вдалося отримати повідомлення з пристрою.";
kAMDMissingOptionsError = "Відсутні параметри.";
kAMDMissingImageTypeError = "Відсутній образ.";
kAMDDigestFailedError = "Не вдалося прочитати образ диска.";
kAMDStartServiceError = "Не вдалося запустити службу.";
kAMDInvalidDiskImageError = "Неправильний образ диска.";
kAMDMissingDigestError = "Відсутній дайджест.";
kAMDMuxError = "Сталася помилка мультиплексора USB-пристрою.";
kAMDApplicationAlreadyInstalledError = "На цьому пристрої вже встановлено системну програму з таким ідентифікатором пакету, і її не можна замінити.";
kAMDApplicationMoveFailedError = "Не вдалося перемістити програму на пристрій.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Не вдалося помістити програму в пісочницю.";
kAMDApplicationVerificationFailedError = "Не вдалося перевірити програму.";
kAMDArchiveDestructionFailedError = "Не вдалося видалити архів програм.";
kAMDBundleVerificationFailedError = "Не вдалося перевірити пакет послуг оператора.";
kAMDCarrierBundleCopyFailedError = "Не вдалося встановити пакет послуг оператора.";
kAMDCarrierBundleDirectoryCreationFailedError = "Не вдалося створити каталог пакета послуг оператора.";
kAMDCarrierBundleMissingSupportedSIMsError = "Для цього пакету послуг оператора немає жодної підтримуваної SIM-карти.";
kAMDCommCenterNotificationFailedError = "Не вдалося прослухати оповіщення модуля зв’язку.";
kAMDContainerCreationFailedError = "Не вдалося створити блок програми.";
kAMDContainerP0wnFailedError = "Не вдалося виправити дозволи у блоці програм.";
kAMDContainerRemovalFailedError = "Не вдалося видалити блок програм.";
kAMDEmbeddedProfileInstallFailedError = "Не вдалося установити вбудований профіль ініціалізації.";
kAMDErrorError = "Сталася помилка.";
kAMDExecutableTwiddleFailedError = "Не вдалося змінити виконувані дозволи у програмі.";
kAMDExistenceCheckFailedError = "Не вдалося перевірити, чи вже наявна ця програма. ";
kAMDInstallMapUpdateFailedError = "Не вдалося оновити список установлених програм.";
kAMDManifestCaptureFailedError = "Не вдалося зберегти маніфест програми.";
kAMDMapGenerationFailedError = "Не вдалося створити карту.";
kAMDMissingBundleExecutableError = "Комплект програм не містить виконуваний елемент.";
kAMDMissingBundleIdentifierError = "Комплект програм не містить дійсний ідентифікатор.";
kAMDMissingBundlePathError = "Не вдалося визначити шлях до програми.";
kAMDMissingContainerError = "Не вдалося знайти блок для встановленої програми.";
kAMDNotificationFailedError = "Не вдалося розмістити оповіщення.";
kAMDPackageExtractionFailedError = "Не вдалося відкрити пакет програм.";
kAMDPackageInspectionFailedError = "Не вдалося перевірити пакет програми.";
kAMDPackageMoveFailedError = "Не вдалося перемістити пакет програми в розташування перенесення даних.";
kAMDPathConversionFailedError = "Не вдалося перетворити шлях.";
kAMDRestoreContainerFailedError = "Не вдалося відновити блок програм.";
kAMDSeatbeltProfileRemovalFailedError = "Не вдалося видалити захисний профіль програми.";
kAMDStageCreationFailedError = "Не вдалося створити каталог перенесення даних.";
kAMDSymlinkFailedError = "Не вдалося створити символьне посилання.";
kAMDiTunesArtworkCaptureFailedError = "Не вдалося зберегти обкладинку з iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Не вдалося зберегти метадані з iTunes.";
kAMDAlreadyArchivedError = "Програму вже архівовано.";
kAMDUnknownCommandError = "Пристрій не розпізнає команду.";
kAMDAPIInternalError = "Сталася внутрішня помилка API.";
kAMDMuxCreateListenerError = "Не вдалося прослухати USB-пристрої.";
kAMDMuxGetListenerError = "Не вдалося дістатися до USB-приймача.";
kAMDMuxConnectError = "Не вдалося підключитися до пристрою.";
kAMDDeviceTooNewError = "Потрібно оновити цю програму.";
kAMDDeviceRefNoGood = "Цей пристрій більше не підключено.";
kAMDDeviceDisconnectedError = "Цей пристрій більше не підключено.";
kAMDCannotTranslateError = "Не вдалося передати повідомлення з пристрою.";
kAMDMobileImageMounterMissingImageSignature = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterResponseCreationFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterMissingImageType = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterMissingImagePath = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterImageMapLoadFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterAlreadyMounted = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterImageMoveFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterMountPathMissing = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterMountPathNotEmpty = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterImageMountFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterDigestFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterDigestCreationFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterImageVerificationFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterImageInfoCreationFailed = "Не вдалося підтримати розробку.";
kAMDMobileImageMounterImageMapStoreFailed = "Не вдалося підтримати розробку.";
kAMDDeviceOSVersionTooLow = "Версія ОС пристрою застаріла.";
kAMDNoWifiSyncSupportError = "Пристрій не підтримує безпроводову синхронізацію.";
kAMDDeviceFamilyNotSupported = "Ця програма не підтримує цей тип пристрою.";
kAMDPackagePatchFailedError = "Не вдалося застосувати оновлення для програми.";
kAMDIncorrectArchitectureError = "Ця програма не підтримує тип ЦП цього пристрою.";
kAMDPluginCopyFailedError = "Не вдалося скопіювати плагін VPN у контейнер програми.";
kAMDBreadcrumbFailedError = "Не вдалося записати крихту інсталяції.";
kAMDBreadcrumbUnlockError = "Не вдалося оновити крихту інсталяції.";
kAMDGeoJSONCaptureFailedError = "Не вдалося зберегти дані GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Не вдалося зберегти обкладинку з Кіоску.";
kAMDMissingCommandError = "Запит не містив команди.";
kAMDNotEntitledError = "Програмі, що робить запит, заборонено робити цей запит.";
kAMDMissingPackagePathError = "Запиту бракувало шляху до пакета.";
kAMDMissingContainerPathError = "Запиту бракувало шляху до контейнера.";
kAMDMissingApplicationIdentifierError = "Запиту бракувало ідентифікатора програми.";
kAMDMissingAttributeValueError = "Запиту бракувало потрібного значення.";
kAMDLookupFailedError = "Не вдалося дістати список встановлених програм.";
kAMDDictCreationFailedError = "Не вдалося витягнути можливості з запиту.";

/* kMISFileError */
"A file operation failed." = "Помилка операції з файлом.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Підписаний ресурс було додано, змінено або видалено.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Для цього виконуваного модуля не знайдено жодного припустимого профілю ініціалізації.";

/* kMISUnknownError */
"An unknown error has occurred." = "Сталася невідома помилка.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Спроба змінити незмінний профіль ініціалізації.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Програма не має дійсний підпис.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Підпис програми дійсний, але він не відповідає очікуваному значенню.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Виконуваний модуль містить недійсний підпис.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Виконуваний модуль підписано з неприпустимими правами.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Цифровий підпис, яким підписано виконуваний модуль, більше не є дійсним.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Підпис виявився недійсним.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Помилка зв’язку з пристроєм.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Не можна встановити на пристрій цей профіль ініціалізації.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Цей профіль ініціалізації не має дійсний підпис (або має дійсний підпис, який не є надійним).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Завершився термін дії цього профілю ініціалізації.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Спотворений профіль ініціалізації.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Непідтримуваний профіль ініціалізації.";

/* kMISAllocationError */
"Unable to allocate memory." = "Не вдається виділити пам’ять.";

